<?php
/**
 * | AndPHP框架[基于ThinkPHP5开发]
 * +----------------------------------------------------------------------
 * | Copyright (c) 2017-2019 http://www.andphp.com
 * +----------------------------------------------------------------------
 * | AndPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
 * +----------------------------------------------------------------------
 * | author    :BabySeeME <417170808@qq.com>
 * +----------------------------------------------------------------------
 * | createTime :2018/3/3 000313:58
 * +----------------------------------------------------------------------
 */

namespace app\admin\validate;


class AuthGroup extends AdminValidate
{
    /**
     * 校验规则
     * @var array
     */
    protected $rule = [
        'title'  => 'require|max:25',
        'rules'  => 'array',
    ];

    /**
     * 校验NG返回错误信息
     * @var array
     */
    protected $message= [
        'title.require'  => '权限名称不能为空',
        'title.max'       => '权限名称最多不能超过25个字符',
        'rules.array'     => '规则格式不正确',
    ];
}