<?php
/**
 * | AndPHP框架[基于ThinkPHP5开发]
 * +----------------------------------------------------------------------
 * | Copyright (c) 2017-2019 http://www.andphp.com
 * +----------------------------------------------------------------------
 * | AndPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
 * +----------------------------------------------------------------------
 * | author    :BabySeeME <417170808@qq.com>
 * +----------------------------------------------------------------------
 * | createTime :2018/3/2 000219:19
 * +----------------------------------------------------------------------
 */

namespace app\common\model;


use think\Model;

class ModelBase extends Model
{
    /**
     * 开启自动记录时间戳
     * @var bool
     */
    protected  $autoWriteTimestamp = true;
}