<?php
/**
 * | AndPHP [ PHP and I ]
 * +----------------------------------------------------------------------
 * | Copyright (c) 2017-2022 http://www.wyz.ltd All rights reserved
 * +----------------------------------------------------------------------
 * | AndPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
 * +----------------------------------------------------------------------
 * | Author : BabySeeME <417170808@qq.com>
 * +----------------------------------------------------------------------
 * | CreateTime : 2018/4/27 002715:54
 * +----------------------------------------------------------------------
 */

namespace app\common\model;


class NavGroup extends ModelBase
{
    public function nav()
    {
        return $this->hasMany('Nav','group_id','id');
    }
}